[
    {
        "id": 10,
        "Organisation": "Project Management Institute",
        "Artical_title": "Certified Associate in Project Management (CAPM)",
        "Artical_link": "https://www.credly.com/badges/fa6b4b1a-67c7-4d23-8fd1-fbe13b08d244/linked_in_profile",
        "Artical_Summary": "Achieved the Certified Associate in Project Management (CAPM) certification from the Project Management Institute. This certification demonstrates my understanding of project management principles and practices, enhancing my ability to contribute effectively to project teams.",
        "date_published": "2025, Mar"
    },
    {
        "id": 10,
        "Organisation": "Arizona State University || Adidas",
        "Artical_title": "Research Assistant",
        "Artical_link": null,
        "Artical_Summary": "Worked with Adidas through Arizona State University as a Research Assistant. Conducted advanced data analytics on high-volume sales data, covering over 40,000 postal codes across the U.S., using demographic and mall traffic datasets to map consumer trends and identify high-performing zones.",
        "date_published": "2024, May"
    },
    {
        "id": 9,
        "Organisation": "@Me",
        "Artical_title": "Portfolio",
        "Artical_link": "/",
        "Artical_Summary": "Started Making my portfolio using React.js and Next.js. Deployed it on Vercel. This portfolio showcases my projects, skills, and experiences in software development, providing a comprehensive overview of my professional journey.",
        "date_published": "2024, Jan"
    },
    {
        "id": 8,
        "Organisation": "Arizona State University",
        "Artical_title": "Homorphic Encryption for Secure Data Sharing",
        "Artical_link": "https://github.com/joellui/Homomorphic-Encryption---SEAL",
        "Artical_Summary": "Worked using Microsoft SEAL to implement homomorphic encryption for secure data sharing. This project focused on enhancing data privacy and security in cloud computing environments, allowing computations on encrypted data without decryption.",
        "date_published": "2023, Nov"
    },
    {
        "id": 8,
        "Organisation": "Starbucks",
        "Artical_title": "Barista",
        "Artical_link": null,
        "Artical_Summary": "Worked as a Barista at Starbucks, where I honed my customer service skills and learned the importance of teamwork in a fast-paced environment. This role taught me how to manage time effectively while ensuring high-quality service.",
        "date_published": "2023, Oct"
    },
    {
        "id": 7,
        "Organisation": "Trustle",
        "Artical_title": "Software Developer for End-to-End Product",
        "Artical_link": null,
        "Artical_Summary": "Designed and implemented a complete end-to-end product at Trustle, a UK-based company. This role involved comprehensive development from initial concept through to deployment, focusing on creating scalable and efficient software solutions.",
        "date_published": "2022, Dec"
    },
    {
        "id": 6,
        "Organisation": "Leagato Health Technology",
        "Artical_title": "Associate Software Developer",
        "Artical_link": null,
        "Artical_Summary": "Worked as an Associate Software Developer at Leagato Health Technology, focusing on backend architecture. Developed APIs and webhooks that facilitated data exchange and integration across various services within the healthcare sector.",
        "date_published": "2022, Jun"
    },
    {
        "id": 5,
        "Organisation": "Kitsu",
        "Artical_title": "Open Source Developer for Kitsu Streaming App",
        "Artical_link": "https://github.com/ryuu-blue/Ryu",
        "Artical_Summary": "Led the development of Kitsu, an open-source streaming application for anime. This project involved using Kotlin to build a robust, scalable app that supports streaming and community interaction.",
        "date_published": "2021, Nov"
    },
    {
        "id": 4,
        "Organisation": "Christ University",
        "Artical_title": "Web Development Team Member",
        "Artical_link": null,
        "Artical_Summary": "Served as a key member of the web development team at Christ University, tasked with updating and upgrading specific sections of the university's website. My responsibilities included redesigning user interfaces and enhancing site navigation and accessibility.",
        "date_published": "2021, Oct"
    },
    {
        "id": 3,
        "Organisation": "Android App Store",
        "Artical_title": "Game Development with C# and Unity",
        "Artical_link": "https://github.com/joellui/Dodge",
        "Artical_Summary": "Developed multiple games using C# and Unity, later published on the Android App Store. These projects allowed me to explore game mechanics, graphics, and user interaction in a mobile environment.",
        "date_published": "2021, May"
    },
    {
        "id": 2,
        "Organisation": "Tata Communication",
        "Artical_title": "Internship: Website Update with Angular",
        "Artical_link": null,
        "Artical_Summary": "Updated the Tata Communication website, incorporating new features and enhancements using the Angular framework. This was my initial exposure to Angular, providing a solid foundation in modern web development practices.",
        "date_published": "2021, Mar"
    },
    {
        "id": 1,
        "Organisation": "Prodevans",
        "Artical_title": "Internship: ETL Tool Development",
        "Artical_link": null,
        "Artical_Summary": "Developed an ETL tool during my first internship at Prodevans. This project involved designing, implementing, and testing ETL processes crucial for data integration and data warehousing solutions.",
        "date_published": "2020, Mar"
    }
]
